read_verilog upstream/Controller.v
hierarchy -check -top Controller
setattr -set init 0 Controller/w:next_State
proc
flatten
opt
setundef -zero
techmap
opt
dffunmap
aigmap
write_aiger -ascii -symbols generated/controller.aag
