read_verilog physical-plant.v
hierarchy -check -top WashingPlant
proc
formalff -clk2ff
flatten
opt
setundef -zero
techmap
opt
dffunmap
aigmap
write_aiger -ascii -symbols physical-plant.aag
